package cond;

public class Ex {
    /*
    * if vs switch문
    switch문의 조건식을 넣는 부분을 잘 보면 x > 10과 같은 참 거짓의 결과가 나오는 조건이 아니라, 단순히 값만 넣을 수 있다
    switch문은 조건식이 특정 case와 같은지만 체크할 수 있다
    쉽게 이야기 해서 값이 같은지 확인하는 연산만 가능하다 (문자도 가능)
    반면 if문은 참 거짓의 결과가 나오는 조건식을 자유롭게 적을 수 있다 ex) x > 10, x == 10

    정리하자면 switch문 없이 if문만 사용해도 된다. 하지만 특정 값에 따라 코드를 실행할 때는 switch문을 사용하면 if문 보다 간결한 코드를 작성
    할 수 있다
    
    
    * 참과 거짓에 따라서 특정 값을 구하는 경우 삼항 연산자 또는 조건 연산자라고 불리는 ?: 연산자를 사용할 수 있다
         이 연산자를 사용하면 if문과 비교해서 코드를 단순화 할 수 있다
    
     */
}
